== Secrets Manager

// tag::summary[]

[%header,cols="35a,65a"]
|===
|Command |Description
|xref:anypoint-cli::secrets-manager.adoc#secret-group-create[secrets-mgr:secret-group:create]| Creates a new secret group
|xref:anypoint-cli::secrets-manager#secret-group-delete[secrets-mgr:secret-group:delete]| Deletes a secret group
|xref:anypoint-cli::secrets-manager.adoc#secret-group-describe[secrets-mgr:secret-group:describe]| Shows details of a secret group
|xref:anypoint-cli::secrets-manager.adoc#secret-group-list[secrets-mgr:secret-group:list]| Lists secret groups
|xref:anypoint-cli::secrets-manager.adoc#secret-group-modify[secrets-mgr:secret-group:modify]| Modifies a secret group
|xref:anypoint-cli::secrets-manager.adoc#secret-shared-create[secrets-mgr:shared-secret:create]| Creates a shared secret in a secret group
|xref:anypoint-cli::secrets-manager.adoc#secret-shared-describe[secrets-mgr:shared-secret:describe]| Shows details of a shared secret
|xref:anypoint-cli::secrets-manager.adoc#secret-shared-list[secrets-mgr:shared-secret:list]| Lists all shared secrets in a secret group
|xref:anypoint-cli::secrets-manager.adoc#secret-shared-modify[secrets-mgr:shared-secret:modify]| Modifies a shared secret
|xref:anypoint-cli::secrets-manager.adoc#secret-shared-replace[secrets-mgr:shared-secret:replace]| Replaces an existing shared secret
|xref:anypoint-cli::secrets-manager.adoc#secret-certificate-create[secrets-mgr:certificate:create]| Creates a new certificate secret
|xref:anypoint-cli::secrets-manager.adoc#secret-certificate-describe[secrets-mgr:certificate:describe]| Shows details of a certificate secret
|xref:anypoint-cli::secrets-manager.adoc#secret-certificate-list[secrets-mgr:certificate:list]| Lists all certificate secrets in a secret group
|xref:anypoint-cli::secrets-manager.adoc#secret-certificate-modify[secrets-mgr:certificate:modify]| Modifies a certificate secret
|xref:anypoint-cli::secrets-manager.adoc#secret-certificate-replace[secrets-mgr:certificate:replace]| Replaces an existing certificate secret
|xref:anypoint-cli::secrets-manager.adoc#secret-keystore-create[secrets-mgr:keystore:create]| Creates a new keystore secret
|xref:anypoint-cli::secrets-manager.adoc#secret-keystore-describe[secrets-mgr:keystore:describe]| Shows details of a keystore secret
|xref:anypoint-cli::secrets-manager.adoc#secret-keystore-list[secrets-mgr:keystore:list]| Lists all keystore secrets in a secret group
|xref:anypoint-cli::secrets-manager.adoc#secret-keystore-modify[secrets-mgr:keystore:modify]| Modifies a keystore secret
|xref:anypoint-cli::secrets-manager.adoc#secret-keystore-replace[secrets-mgr:keystore:replace]| Replaces an existing keystore secret
|xref:anypoint-cli::secrets-manager.adoc#secret-truststore-create[secrets-mgr:truststore:create]| Creates a new truststore secret
|xref:anypoint-cli::secrets-manager.adoc#secret-truststore-describe[secrets-mgr:truststore:describe]| Shows details of a truststore secret
|xref:anypoint-cli::secrets-manager.adoc#secret-truststore-list[secrets-mgr:truststore:list]| Lists all truststore secrets in a secret group
|xref:anypoint-cli::secrets-manager.adoc#secret-truststore-modify[secrets-mgr:truststore:modify]| Modifies a truststore secret
|xref:anypoint-cli::secrets-manager.adoc#secret-truststore-replace[secrets-mgr:truststore:replace]| Replaces an existing truststore secret
|xref:anypoint-cli::secrets-manager.adoc#secret-TLS-context-create[secrets-mgr:tls-context:mule:create]| Creates a new Mule TLS Context secret
|xref:anypoint-cli::secrets-manager.adoc#secret-TLS-context-describe[secrets-mgr:tls-context:mule:describe]| Shows details of a Mule TLS context secret
|xref:anypoint-cli::secrets-manager.adoc#secret-TLS-context-list[secrets-mgr:tls-context:mule:list]| Lists all Mule TLS context secrets in a secret group
|xref:anypoint-cli::secrets-manager.adoc#secret-TLS-context-modify[secrets-mgr:tls-context:mule:modify]| Modifies a Mule TLS context secret
|xref:anypoint-cli::secrets-manager.adoc#secret-TLS-context-replace[secrets-mgr:tls-context:mule:replace]| Replaces an existing Mule TLS context secret
|xref:anypoint-cli::secrets-manager.adoc#secret-TLS-flex-create[secrets-mgr:tls-context:flex-gateway:create]| Creates a new Flex Gateway TLS Context secret
|xref:anypoint-cli::secrets-manager.adoc#secret-TLS-flex-describe[secrets-mgr:tls-context:flex-gateway:describe]| Shows details of a Flex Gateway TLS context secret
|xref:anypoint-cli::secrets-manager.adoc#secret-TLS-flex-list[secrets-mgr:tls-context:flex-gateway:list]| Lists all Flex Gateway TLS context secrets in a secret group
|xref:anypoint-cli::secrets-manager.adoc#secret-TLS-flex-modify[secrets-mgr:tls-context:flex-gateway:modify]| Modifies a Flex Gateway TLS context secret
|xref:anypoint-cli::secrets-manager.adoc#secret-TLS-flex-replace[secrets-mgr:tls-context:flex-gatway:replace]| Replaces an existing Flex Gateway TLS context secret


|===

// end::summary[]

// tag::commands[]

[[secret-group-create]]
== secrets-mgr:secret-group:create

----
> secrets-mgr:secret-group:create [flags] 
----

Creates a new secret group with the name specified in `--name`.

Prompt the `--downloadable` flag if you want the secrets in this group to be included in the download when creating an API Manager Proxy.

This command also accepts the default `--help` flag.


[[secret-group-delete]]
== secrets-mgr:secret-group:delete

----
> secrets-mgr:secret-group:delete [flags] 
----
Deletes the secret group specified in `--id` +

[WARNING]
This command does not prompt twice before deleting. If you send a delete instruction, it does not ask for confirmation.

This command accepts the default flag `--help`.

[[secret-group-describe]]
== secrets-mgr:secret-group:describe

----
> secrets-mgr:secret-group:describe [flags]
----

Returns the details of a secret group specified in `--id`. 

This command accepts the default flag `--help`.

[[secret-group-list]]
== secrets-mgr:secret-group:list

----
> secrets-mgr:secret-group:list [flags]
----

Displays all your secret groups. It returns the name of the secret group, and the ID.

This command accepts only the default flag `--help`.

[[secrets-group-modify]]
== secrets-mgr:secret-group:modify

----
> secrets-mgr:secret-group:modify  [flags] 
----

Modifies a secret group you pass in `--id`. +

Besides the default flag `--help`, this command also accepts:

[%header,cols="30a,40a,30a"]
|===
|Flag | Description |  Example
|`--name` | New name for your secret group | `--name TestSecretGroup`
|`--downloadable` | Make your secret group downloadable | `--downloadable`
|`--no-downloadable` | Make your secret group non-downloadable. | `--no-downloadable`

|===

[[secret-shared-create]]
== secrets-mgr:shared-secret:create

----
> secrets-mgr:shared-secret:create [flags] 
----

Creates a new shared secret in the secret group specified in `--group-id`, using the name specified in `--name` and the type specified in `--type`. 

Besides the default flag `--help`, this command also accepts:

[%header,cols="30a,40a,30a"]
|===
|Flag | Description |  Example
|`--group-id`| Mandatory. Secret group ID. | `--group-id 030493`
|`--name`|Mandatory. Name for your secret. | `--name TestSecret`
|`--type` | Mandatory. Choose the shared secret type. +
Options: Blob, UsernamePassword, SymmetricKey, S3Credential | `--type UsernamePassword`
|`--content` |Blob text content (for blob type secrets)| `--type Blob --content example`
|`--expiration-date`| Expiration date for the secret. | `--expiration-date 01/01/2025`
|`--key`| Key value (for SymmetricKey type secrets). | `--type SymmetricKey --key 49324329`
|`--access-key-id`| S3 access key id (for S3Credential type secrets). | `--type S3Credential -access-key-id 03249348324`
|`--secret-access-key`| S3 secret access key (for S3Credential type secrets). | `-type S3Credential -secret-access-key 00000000000`
|`--secret-password`| Password (for UsernamePassword type secrets). | `-type UsernamePassword -secret-password testpassword12`
|`--secret-username`| Username (for UsernamePassword type secrets). | `-type UsernamePassword -secret-username mulesoft-username`


|===

[[secret-shared-describe]]
== secrets-mgr:shared-secret:describe

----
> secrets-mgr:shared-secret:describe [flags] 
----
Returns the details of a shared secret specified in `--id` from the secret group you pass in `--group-id`. 

This command accepts the default flag `--help`.

NOTE: The output does not include any sensitive or secret data.


[[secret-shared-list]]
== secrets-mgr:shared-secret:list

----
> secrets-mgr:shared-secret:list [flags]
----

Lists all shared secrets in a secret group specified in `--group-id`

This command accepts the default flag `--help`.

[[secret-shared-modify]]
== secrets-mgr:shared-secret:modify

----
> secrets-mgr:shared-secret:modify  [flags] 
----

Modifies the name or expiration date for a shared secret specified in `--id`, from the secret group you pass in`--groupid` 

Besides the default flag `--help`, this command also accepts:

[%header,cols="30a,40a,30a"]
|===
|Flag | Description |  Example
|`--name` | New name for the shared secret | `--name TestSharedSecret`
|`--expiration-date` | New expiration date for the shared secret | `--expiration-date 01/01/2025`

|===

[[secrets-shared-replace]]
== secrets-mgr:secret-group:replace

----
> secrets-mgr:shared-secret:replace  [flags] 
----

Replaces an existing shared secret you pass in `--id`, from the secret group you pass in `--group-id`, using the type you pass in `--type`. 

Besides the default flag `--help`, this command also accepts:

[%header,cols="30a,40a,30a"]
|===
|Flag | Description |  Example
|`--id`| Mandatory. Secret ID. | `--id 030493`
|`--group-id`|Mandatory. Secret Group ID. | `--group-id 000000`
|`--type`| Mandatory. Shared secret type. The value must match the existing secret type. | `--type Blob`
|`--name` | New name for your shared secret | `--name TestSharedSecret`
|`--content` |Blob text content (for blob type secrets)| `--type Blob --content example`
|`--expiration-date`| Expiration date for the secret. | `--expiration-date 01/01/2025`
|`--key`| Key value (for SymmetricKey type secrets). | `--type SymmetricKey --key 49324329`
|`--access-key-id`| S3 access key id (for S3Credential type secrets). | `--type S3Credential -access-key-id 03249348324`
|`--secret-access-key`| S3 secret access key (for S3Credential type secrets). | `-type S3Credential -secret-access-key 00000000000`
|`--secret-password`| Password (for UsernamePassword type secrets). | `-type UsernamePassword -secret-password testpassword12`
|`--secret-username`| Username (for UsernamePassword type secrets). | `-type UsernamePassword -secret-username mulesoft-username`

|===

[[secret-certificate-create]]
== secrets-mgr:certificate:create

----
> secrets-mgr:certificate:create [flags] 
----

Creates a new certificate secret in the secret group specified in `--group-id`, using the name specified in `--name` and the type specified in `--type`. 

Besides the default flag `--help`, this command also accepts:

[%header,cols="30a,40a,30a"]
|===
|Flag | Description |  Example
|`--group-id`| Mandatory. Secret group ID. | `--group-id 030493`
|`--name`|Mandatory. Name for your secret. | `--name TestSecret`
|`--type` | Mandatory. Choose the certificate secret type. +
Options: PEM. | `--type PEM`
|`--cert-file` |Certificate file type | `--cert-file json`
|`--expiration-date`| Expiration date for the secret. | `--expiration-date 01/01/2025`

|===

[[secret-certificate-describe]]
== secrets-mgr:certificate:describe

----
> secrets-mgr:certificate:describe [flags] 
----
Returns the details of a certificate secret specified in `--id` from the secret group you pass in `--group-id`. 

This command accepts the default flag `--help`.

NOTE: The output does not include any sensitive or secret data.


[[secret-certificate-list]]
== secrets-mgr:certificate:list

----
> secrets-mgr:certificate:list [flags]
----

Lists all certificate secrets in a secret group specified in `--group-id`

This command accepts the default flag `--help`.

[[secret-certificate-modify]]
== secrets-mgr:certificate:modify

----
> secrets-mgr:certificate:modify  [flags] 
----

Modifies the name or expiration date for a certificate secret specified in `--id` from the group you pass in`--groupid`. 

Besides the default flag `--help`, this command also accepts:

[%header,cols="30a,40a,30a"]
|===
|Flag | Description |  Example
|`--name` | New name for the certificate secret | `--name TestCertificateSecret`
|`--expiration-date` | New expiration date for the keystore secret | `--expiration-date 01/01/2025`

|===

[[secrets-certificate-replace]]
== secrets-mgr:certificate:replace

----
> secrets-mgr:certificate:replace  [flags] 
----

Replaces an existing certificate secret you pass in `--id`, from the secret group you pass in `--group-id`, using the type you pass in `--type`. 

Besides the default flag `--help`, this command also accepts:

[%header,cols="30a,40a,30a"]
|===
|Flag | Description |  Example
|`--id`| Mandatory. Secret ID. | `--id 030493`
|`--group-id`|Mandatory. Secret Group ID. | `--group-id 000000`
|`--type`| Mandatory. Certificate secret type. The value must match the existing secret type. | `--type PEM`
|`--name` | New name for your shared secret | `--name TestSharedSecret`
|`--cert-file` |Certificate file type | `--cert-file json`
|`--expiration-date`| Expiration date for the secret. | `--expiration-date 01/01/2025`


|===


[[secret-keystore-create]]
== secrets-mgr:keystore:create

----
> secrets-mgr:keystore:create [flags] 
----

Creates a new keystore secret in the secret group specified in `--group-id`, using the name specified in `--name` and the type specified in `--type`. 

Besides the default flag `--help`, this command also accepts:

[%header,cols="30a,40a,30a"]
|===
|Flag | Description |  Example
|`--group-id`| Mandatory. Secret group ID. | `--group-id 030493`
|`--name`|Mandatory. Name for your secret. | `--name TestSecret`
|`--type` | Mandatory. Choose the keystore secret type. +
Options: PEM, JKS, PKCS12, JCEKS. | `--type PEM`
|`--algorithm` |Key manager factory algorithm for  JKS, PKCS12, and JCEKS keystore secrets. | `--algorithm PKIX`
|`--alias`| Alias for the key used in JKS, PKCS12, and JCEKS keystore secrets. | `--alias KeyAliasExample`
|`--capath-file`| CA path certificate file for PEM keystore secrets. | `--capath-file examplefile.pem`
|`--expiration-date`| Expiration date for the secret| `--expiration-date 01/01/2025`
|`--key-file`| Key file for PEM keystore secrets| `--key-file examplefile.pem`
|`--key-passphrase`|Passphrase required for JKS, PKCS12 and JCEKS keystore secrets. Optional for PEM keystore secrets| `--key-passphrase examplePassphrase`
|`--keystore-file` |Keystore filepath for JKS, PKCS12, and JCEKS type secrets. | `--keystore-file keystorefile`


|===

[[secret-keystore-describe]]
== secrets-mgr:keystore:describe

----
> secrets-mgr:keystore:describe [flags] 
----

Returns the details of a keystore secret specified in `--id` from the secret group you pass in `--group-id`. 

This command accepts the default flag `--help`.

NOTE: The output does not include any sensitive or secret data.


[[secret-keystore-list]]
== secrets-mgr:keystore:list

----
> secrets-mgr:keystore:list [flags]
----

Lists all keystore secrets in a secret group specified in `--group-id`

This command accepts the default flag `--help`.

[[secret-keystore-modify]]
== secrets-mgr:keystore:modify

----
> secrets-mgr:keystore:modify  [flags] 
----

Modifies the name or expiration date for a keystore secret specified in `--id` from the group you pass in`--groupid`. 

Besides the default flag `--help`, this command also accepts:

[%header,cols="30a,40a,30a"]
|===
|Flag | Description |  Example
|`--name` | New name for the keystore secret | `--name TestKeystoreSecret`
|`--expiration-date` | New expiration date for the keystore secret | `--expiration-date 01/01/2025`

|===

[[secrets-keystore-replace]]
== secrets-mgr:keystore:replace

----
> secrets-mgr:keystore:replace  [flags] 
----

Replaces an existing keystore secret you pass in `--id`, from the secret group you pass in `--group-id`, using the type you pass in `--type`. 

Besides the default flag `--help`, this command also accepts:

[%header,cols="30a,40a,30a"]
|===
|Flag | Description |  Example
|`--id`| Mandatory. Secret ID. | `--id 030493`
|`--type` | Mandatory. Choose the keystore secret type. +
Options: PEM, JKS, PKCS12, JCEKS. | `--type PEM`
|`--algorithm` |Key manager factory algorithm for  JKS, PKCS12, and JCEKS keystore secrets. | `--algorithm PKIX`
|`--alias`| Alias for the key used in JKS, PKCS12, and JCEKS keystore secrets. | `--alias KeyAliasExample`
|`--capath-file`| CA path certificate file for PEM keystore secrets. | `--capath-file examplefile.pem`
|`--expiration-date`| Expiration date for the secret| `--expiration-date 01/01/2025`
|`--key-file`| Key file for PEM keystore secrets| `--key-file examplefile.pem`
|`--key-passphrase`|Passphrase required for JKS, PKCS12 and JCEKS keystore secrets. Optional for PEM keystore secrets| `--key-passphrase examplePassphrase`
|`--keystore-file` |Keystore filepath for JKS, PKCS12, and JCEKS type secrets. | `--keystore-file keystorefile`
|`--name`| Name for your secret. | `--name TestSecret`

|===

[[secret-truststore-create]]
== secrets-mgr:truststore:create

----
> secrets-mgr:truststore:create [flags] 
----

Creates a new truststore secret in the secret group specified in `--group-id`, using the name specified in `--name` and the type specified in `--type`. 

Besides the default flag `--help`, this command also accepts:

[%header,cols="30a,40a,30a"]
|===
|Flag | Description |  Example
|`--group-id`| Mandatory. Secret group ID. | `--group-id 030493`
|`--name`|Mandatory. Name for your secret. | `--name TestSecret`
|`--type` | Mandatory. Choose the truststore secret type. +
Options: PEM, JKS, PKCS12, JCEKS. | `--type PEM`
|`--truststore-file` |Mandatory. Truststore filepath. | `--truststore-file truststorefile`
|`--algorithm` |Key manager factory algorithm for  JKS, PKCS12, and JCEKS keystore secrets. | `--algorithm SUNX509`
|`--expiration-date`| Expiration date for the secret| `--expiration-date 01/01/2025`
|`--store-passphrase`|Passphrase required for JKS, PKCS12 and JCEKS keystore secrets. | `--store-passphrase examplePassphrase`

|===

[[secret-truststore-describe]]
== secrets-mgr:truststore:describe

----
> secrets-mgr:truststore:describe [flags] 
----

Returns the details of a truststore secret specified in `--id` from the secret group you pass in `--group-id`. 

This command accepts the default flag `--help`.

NOTE: The output does not include any sensitive or secret data.


[[secret-truststore-list]]
== secrets-mgr:truststore:list

----
> secrets-mgr:truststore:list [flags]
----

Lists all truststore secrets in a secret group specified in `--group-id`

This command accepts the default flag `--help`.

[[secret-truststore-modify]]
== secrets-mgr:truststore:modify

----
> secrets-mgr:truststore:modify  [flags] 
----

Modifies the name or expiration date for a truststore secret specified in `--id` from the group you pass in`--groupid`. 

Besides the default flag `--help`, this command also accepts:

[%header,cols="30a,40a,30a"]
|===
|Flag | Description |  Example
|`--name` | New name for the truststore secret | `--name TestTruststoreSecret`
|`--expiration-date` | New expiration date for the truststore secret | `--expiration-date 01/01/2025`

|===

[[secrets-truststore-replace]]
== secrets-mgr:truststore:replace

----
> secrets-mgr:truststore:replace  [flags] 
----

Replaces an existing truststore secret you pass in `--id`, from the secret group you pass in `--group-id`, using the type you pass in `--type`. 

Besides the default flag `--help`, this command also accepts:

[%header,cols="30a,40a,30a"]
|===
|Flag | Description |  Example
|`--id`| Mandatory. Secret ID. | `--id 030493`
|`--type` | Mandatory. Choose the truststore secret type. +
Options: PEM, JKS, PKCS12, JCEKS. | `--type PEM`
|`--truststore-file` |Mandatory. Truststore filepath. | `--truststore-file truststorefile`
|`--algorithm` |Key manager factory algorithm for  JKS, PKCS12, and JCEKS keystore secrets. | `--algorithm SUNX509`
|`--expiration-date`| Expiration date for the secret| `--expiration-date 01/01/2025`
|`--name`| Name for your secret. | `--name TestSecret`
|`--store-passphrase`|Passphrase required for JKS, PKCS12 and JCEKS keystore secrets. | `--store-passphrase examplePassphrase`

|===


[[secret-TLS-context-create]]
== secrets-mgr:tls-context:mule:create

----
> secrets-mgr:tls-context:mule:create [flags] 
----

Creates a new Mule TLS Context secret in the secret group specified in `--group-id`, and using the name specified in `--name`.

Besides the default flag `--help`, this command also accepts:

[%header,cols="30a,40a,30a"]
|===
|Flag | Description |  Example
|`--group-id`| Mandatory. Secret group ID. | `--group-id 030493`
|`--name`|Mandatory. Name for your secret. | `--name TestSecret`
|`--tls-version` |TLS Version +
Default: TLSv1.2. | `--tls-version TLSv1.1`
|`--cipher` |Cipher for the specified TLS version. | `--cipher      TLS_ECDHE_RSA_WITH_AES_128_GCM_SHA256`
|`--expiration-date`| Expiration date for the secret| `--expiration-date 01/01/2025`
|`--insecure`|Disable certificate validation. | `--insecure`
|`--keystore-id`|A valid JKS, JCEKS or PKCS12 keystore ID in the secret group, which is used as keystore for the TLS context. | `--keystore-id 00003443`
|`--truststore-id`|A valid JKS, JCEKS or PKCS12 truststore ID in the secret group, which is used as truststore for the TLS context. | `--truststore-id 001111032`

|===

[[secret-TLS-context-describe]]
== secrets-mgr:tls-context:mule:describe

----
> secrets-mgr:tls-context:mule:describe [flags] 
----

Returns the details of a Mule TLS Context secret specified in `--id` from the secret group you pass in `--group-id`. 

This command accepts the default flag `--help`.

NOTE: The output does not include any sensitive or secret data.


[[secret-TLS-context-list]]
== secrets-mgr:tls-context:mule:list

----
> secrets-mgr:tls-context:mule:list [flags]
----

Lists all Mule TLS Context secrets in a secret group specified in `--group-id`

This command accepts the default flag `--help`.

[[secret-TLS-context-modify]]
== secrets-mgr:tls-context:mule:modify

----
> secrets-mgr:TLS-context:mule:modify  [flags] 
----

Modifies the name or expiration date for a MUle TLS Context secret specified in `--id` from the group you pass in`--groupid`. 

Besides the default flag `--help`, this command also accepts:

[%header,cols="30a,40a,30a"]
|===
|Flag | Description |  Example
|`--name` | New name for the truststore secret | `--name TestTruststoreSecret`
|`--expiration-date` | New expiration date for the truststore secret | `--expiration-date 01/01/2025`

|===

[[secrets-TLS-context-replace]]
== secrets-mgr:tls-context:mule:replace

----
> secrets-mgr:tls:context:mule:replace  [flags] 
----

Replaces an existing Mule TLS Context secret you pass in `--id`, from the secret group you pass in `--group-id`, using the type you pass in `--type`. 

Besides the default flag `--help`, this command also accepts:

[%header,cols="30a,40a,30a"]
|===
|Flag | Description |  Example
|`--group-id`| Mandatory. Secret group ID. | `--group-id 030493`
|`--name`|Mandatory. Name for your secret. | `--name TestSecret`
|`--tls-version` |TLS Version +
Default: TLSv1.2. | `--tls-version TLSv1.1`
|`--cipher` |Cipher for the specified TLS version. | `--cipher      TLS_ECDHE_RSA_WITH_AES_128_GCM_SHA256`
|`--expiration-date`| Expiration date for the secret| `--expiration-date 01/01/2025`
|`--insecure`|Disable certificate validation. | `--insecure`
|`--keystore-id`|A valid JKS, JCEKS or PKCS12 keystore ID in the secret group, which is used as keystore for the TLS context. | `--keystore-id 00003443`
|`--truststore-id`|A valid JKS, JCEKS or PKCS12 truststore ID in the secret group, which is used as truststore for the TLS context. | `--truststore-id 001111032`

|===

[[secret-TLS-flex-create]]
== secrets-mgr:tls-context:flex-gateway:create

----
> secrets-mgr:tls-context:flex-gateway:create [flags] 
----

Creates a new Flex Gateway TLS Context secret in the secret group specified in `--group-id`, and using the name specified in `--name`.

Besides the default flag `--help`, this command also accepts:

[%header,cols="30a,40a,30a"]
|===
|Flag | Description |  Example
|`--group-id`| Mandatory. Secret group ID. | `--group-id 030493`
|`--name`|Mandatory. Name for your secret. | `--name TestSecret`
|`--max-tls-version` |Maximum TLS Version +
Default: TLSv1.3. | `--tls-version TLSv1.1`
|`--min-tls-version` |Minimum TLS Version +
Default: TLSv1.1. | `--tls-version TLSv1.2`
|`--cipher` |Cipher for the specified TLS version range. | `--cipher TLS_ECDHE_PSK_WITH_CHACHA20_POLY1305_SHA256`
|`--alpn-protocol` |ALPN Protocol. +
Options: h2, http/1.1 | `--alpn-protocol h2`
|`--enable-client-cert-validation`| Enable client certificate validation | `--enable-client-cert-validation`
|`--expiration-date`| Expiration date for the secret| `--expiration-date 01/01/2025`
|`--keystore-id`|A valid PEM keystore ID in the secret group, which is used as keystore for the TLS context. | `--keystore-id 00003443`
|`--truststore-id`|A valid PEM truststore ID in the secret group, which is used as truststore for the TLS context. | `--truststore-id 001111032`
|`--skip-server-cert-validation` | Skip service certificate validation | `--skip-server-cert-validation`

|===

For more information on ciphers, please see xref:flex-gateway::conn-tls-config[Configuring TLS Context for Flex Gateway in Connected Mode]


[[secret-TLS-flex-describe]]
== secrets-mgr:tls-context:flex-gateway:describe

----
> secrets-mgr:tls-context:flex-gateway:describe [flags] 
----

Returns the details of a Flex Gateway TLS Context secret specified in `--id` from the secret group you pass in `--group-id`. 

This command accepts the default flag `--help`.

NOTE: The output does not include any sensitive or secret data.


[[secret-TLS-flex-list]]
== secrets-mgr:tls-context:flex-gateway:list

----
> secrets-mgr:tls-context:flex-gateway:list [flags]
----

Lists all Flex Gateway TLS Context secrets in a secret group specified in `--group-id`

This command accepts the default flag `--help`.

[[secret-TLS-flex-modify]]
== secrets-mgr:tls-context:flex-gateway:modify

----
> secrets-mgr:TLS-context:flex-gateway:modify  [flags] 
----

Modifies the name or expiration date for a Flex Gateway TLS Context secret specified in `--id` from the group you pass in`--groupid`. 

Besides the default flag `--help`, this command also accepts:

[%header,cols="30a,40a,30a"]
|===
|Flag | Description |  Example
|`--name` | New name for the truststore secret | `--name TestTruststoreSecret`
|`--expiration-date` | New expiration date for the truststore secret | `--expiration-date 01/01/2025`

|===

[[secrets-TLS-flex-replace]]
== secrets-mgr:tls-context:flex-gateway:replace

----
> secrets-mgr:tls:context:flex-gateway:replace  [flags] 
----

Replaces an existing Flex Gateway TLS Context secret you pass in `--id`, from the secret group you pass in `--group-id`, using the type you pass in `--type`. 

Besides the default flag `--help`, this command also accepts:


[%header,cols="30a,40a,30a"]
|===
|Flag | Description |  Example
|`--group-id`| Mandatory. Secret group ID. | `--group-id 030493`
|`--name`|Mandatory. Name for your secret. | `--name TestSecret`
|`--max-tls-version` |Maximum TLS Version +
Default: TLSv1.3. | `--tls-version TLSv1.1`
|`--min-tls-version` |Minimum TLS Version +
Default: TLSv1.1. | `--tls-version TLSv1.2`
|`--cipher` |Cipher for the specified TLS version range. | `--cipher TLS_ECDHE_PSK_WITH_CHACHA20_POLY1305_SHA256`
|`--alpn-protocol` |ALPN Protocol. +
Options: h2, http/1.1 | `--alpn-protocol h2`
|`--enable-client-cert-validation`| Enable client certificate validation | `--enable-client-cert-validation`
|`--expiration-date`| Expiration date for the secret| `--expiration-date 01/01/2025`
|`--keystore-id`|A valid PEM keystore ID in the secret group, which is used as keystore for the TLS context. | `--keystore-id 00003443`
|`--truststore-id`|A valid PEM truststore ID in the secret group, which is used as truststore for the TLS context. | `--truststore-id 001111032`
|`--skip-server-cert-validation` | Skip service certificate validation | `--skip-server-cert-validation`

|===
// end::commands[]
